import Container from '@/shared/container/Container';
import Icon from '@/shared/Icon/Icon';
import s from './CreateCustomPage.module.scss';
export default function CreateCustomPage() {
  return (
    <section>
      <Container>
        <div>
          <div>
            <span>Цінності</span>
          </div>
          <h2>
            Мій підхід — це не шаблони, а рішення, що відповідають конкретним
            цілям бізнесу
          </h2>
          <ul>
            <li>
              <div>
                <Icon iconName="icon-programming" className={s.icon} />
              </div>
              <h3>Індивідуальні рішення</h3>
              <p>
                Я не використовую шаблони. Кожен сайт — це унікальне рішення,
                створене під конкретні бізнес-цілі, цільову аудиторію та
                продукт. Я глибоко аналізую задачу, щоб результат працював на
                вас і ваш бренд.
              </p>
            </li>
            <li>
              <div>
                <Icon iconName="icon-interface" className={s.icon} />
              </div>
              <h3>Сильний візуальний стиль</h3>
              <p>
                Завдяки бекграунду у відеопродакшені я вмію створювати візуальні
                рішення, що чіпляють і підсилюють ваш імідж. Мої сайти
                виглядають сучасно, професійно і викликають довіру з першого
                погляду.
              </p>
            </li>
            <li>
              <div>
                <Icon iconName="icon-desktop" className={s.icon} />
              </div>
              <h3>Сучасний UX</h3>
              <p>
                Користувач не повинен думати, як користуватись сайтом. Я
                проєктую логічну, інтуїтивну структуру, що веде людину до
                цільової дії: звернення, покупки, заявки. Ваш сайт буде зручним,
                навіть для тих, хто бачить його вперше.
              </p>
            </li>
            <li>
              <div>
                <Icon iconName="icon-content" className={s.icon} />
              </div>
              <h3>SEO та аналітика</h3>
              <p>
                Я закладаю фундамент для результату — і візуально, і технічно.
                Сайти Framevix оптимізовані під пошукові системи, швидко
                працюють і готові до аналітики. Ви не просто отримуєте красиву
                вітрину, а повноцінний інструмент продажу.
              </p>
            </li>
          </ul>
        </div>
      </Container>
    </section>
  );
}
